export interface IItem {
    id: string
    title: string
    summery: string
    category: string
}

export const items: IItem[] = [
    {
        id: '1',
        title: 'چرا گوگل هک شد ؟',
        summery: 'چون خیلی مزخرف و چرت بود و هیچ کس ازش خوشش نمیومد.',
        category: 'هک و مک'
    },
    {
        id: '2',
        title: 'چرا اپل هک شد ؟',
        summery: 'چون همش داده های کاربران رو به دیگران میفروخت و به دروغ میگفت که داده های کاربراش مهمه.',
        category: 'هک و مک'
    },
    {
        id: '3',
        title: 'رایکانکت رو کی زده ؟',
        summery: 'من و یکسری آدمای دیگه ! چی کار داری داش ؟',
        category: 'تارخچه نامه',
    },
    {
        id: '4',
        title: 'قابلمه کیلویی چند ؟',
        summery: 'قابلمه مگه کیلویی هم میفروشن که برات انقدر مهم شده ؟',
        category: 'فروش',
    },
    {
        id: '1',
        title: 'چرا گوگل هک شد ؟',
        summery: 'چون خیلی مزخرف و چرت بود و هیچ کس ازش خوشش نمیومد.',
        category: 'هک و مک'
    },
    {
        id: '2',
        title: 'چرا اپل هک شد ؟',
        summery: 'چون همش داده های کاربران رو به دیگران میفروخت و به دروغ میگفت که داده های کاربراش مهمه.',
        category: 'هک و مک'
    },
    {
        id: '3',
        title: 'رایکانکت رو کی زده ؟',
        summery: 'من و یکسری آدمای دیگه ! چی کار داری داش ؟',
        category: 'تارخچه نامه',
    },
    {
        id: '4',
        title: 'قابلمه کیلویی چند ؟',
        summery: 'قابلمه مگه کیلویی هم میفروشن که برات انقدر مهم شده ؟',
        category: 'فروش',
    },
];