export interface IBox {
    title: string
    content: string
    redirectTo: string
}

export const boxs: IBox[] = [
    {
        title: 'مستندات',
        content: 'مستندات رایکانکت لوح های گلی از عمق تاریخ اند. با خوندن اونها میتونید یاد بگیرید چطوری یک اپ رایکانکتی توسعه بدید و کاملا با رایکانکت آشنا بشید',
        redirectTo: '/docs'
    },
    {
        title: 'بسته توسعه نرم افزار',
        content: 'رایکانکت سعی کرده با چند زبان برنامه نویسی خودشو سازگار کنه و براش بسته تولید پس میتونید بسته های توسعه رایکانکت رو از اینجا دانلود کنید',
        redirectTo: '/sdk'
    },
    {
        title: 'وبلاگ',
        content: 'تو وبلاگ رایکانکت کلی خبر جذاب و مطالب باحال در مورد رایکانکت و اپ هایی که با رایکانکت ساخته شدند داریم پس وبلاگ ما رو بخونید و حتما ما رو هم در شبکه های اجتماعی دانلود کنید',
        redirectTo: '/blog'
    }
];