export interface IFaq {
    question: string
    answer: string
}

export const faqs: IFaq[] = [
    {
        question: 'رایکانکت چیست ؟',
        answer: 'رای کانکت یک فریم ورک ابری هست ، یعنی بسیاری از ابزار های مورد نیاز شما رو در بستر یک فضای ابری بهتون ارائه میکنه و شما به وسیله اون میتونید مدیریت کاملی بر کاربرانتون و کنترل دسترسی کاربرانتون و هزار و یک چیز داشته باشید حتی توابع بلادرنگ (ریل تایم)'
    },
    {
        question: 'چرا رایکانکت ؟',
        answer: 'مطابق با اینترنت ایران طراحی شده و سعی کرده قطع و وصل رو در نظر بگیره و با یک کش مناسب و خوب سرعت بالایی رو در اختیارتون بزاره'
    }
];